{
  "architectures": [
    "MistralForCausalLM"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 2,
  "dtype": "float16",
  "eos_token_id": 3,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 3072,
  "initializer_range": 0.02,
  "intermediate_size": 10752,
  "max_position_embeddings": 8192,
  "model_type": "mistral",
  "num_attention_heads": 16,
  "num_hidden_layers": 18,
  "num_key_value_heads": 4,
  "pad_token_id": 0,
  "rms_norm_eps": 1e-05,
  "rope_theta": 500000,
  "sliding_window": null,
  "tie_word_embeddings": false,
  "transformers_version": "4.57.3",
  "use_cache": true,
  "vocab_size": 50176
}
